# Используем официальный образ Python 3
FROM python

# Устанавливаем рабочую директорию
WORKDIR /usr/src

# Копируем зависимости
COPY requirements.txt ./

# Устанавливаем зависимости (включая MySQL-коннектор)
# --no-cache-dir чтобы избежать ненужного расхода памяти в контейнере.
# Флаг -r указывает pip, что нужно считать список пакетов из файла.
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь код проекта в docker(создавая в нем туже директорию)
COPY . .
# Добавляем `PYTHONPATH`, чтобы Python видел вложенные модули
ENV PYTHONPATH=/usr/src
# Добавляем ожидание MySQL перед запуском
# Запускает sh (Unix-оболочку) и выполняет команду в ""
# -c — передаёт следующую строку как команду для выполнения.
CMD ["sh", "-c", "sleep 10 && python ./apps/main.py"]
